# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 0s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_resource_group.rg_dp_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_dp_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_resource_group.rg_studio_stag: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_resource_group.rg_studio_dev: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_resource_group.rg_studio_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 2s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 2s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.certmanager will be updated in-place
  ~ resource "helm_release" "certmanager" {
      ~ id                         = "certmanager" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.18.2" -> (known after apply)
          ~ chart          = "cert-manager" -> (known after apply)
          ~ first_deployed = 1755074345 -> (known after apply)
          ~ last_deployed  = 1762875204 -> (known after apply)
          ~ name           = "certmanager" -> (known after apply)
          ~ namespace      = "certmanager" -> (known after apply)
          ~ notes          = <<-EOT
                ⚠️  WARNING: New default private key rotation policy for Certificate resources.
                The default private key rotation policy for Certificate resources was
                changed to Always in cert-manager >= v1.18.0.
                Learn more in the [1.18 release notes](https://cert-manager.io/docs/releases/release-notes/release-notes-1.18).
                
                cert-manager v1.18.2 has been deployed successfully!
                
                In order to begin issuing certificates, you will need to set up a ClusterIssuer
                or Issuer resource (for example, by creating a 'letsencrypt-staging' issuer).
                
                More information on the different types of issuers and how to configure them
                can be found in our documentation:
                
                https://cert-manager.io/docs/configuration/
                
                For information on how to configure cert-manager to automatically provision
                Certificates for Ingress resources, take a look at the ingress-shim
                documentation:
                
                https://cert-manager.io/docs/usage/ingress/
            EOT -> (known after apply)
          ~ revision       = 3 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - config = {
                      - featureGates = {
                          - ACMEHTTP01IngressPathTypeExact = false
                        }
                    }
                  - crds   = {
                      - enabled = true
                    }
                }
            ) -> (known after apply)
          ~ version        = "v1.18.2" -> (known after apply)
        } -> (known after apply)
        name                       = "certmanager"
      ~ version                    = "1.18.2" -> "v1.19.1"
        # (29 unchanged attributes hidden)
    }

  # helm_release.grafana_k8s_monitoring will be updated in-place
  ~ resource "helm_release" "grafana_k8s_monitoring" {
      ~ id                         = "k8s-monitoring" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "3.3.2" -> (known after apply)
          ~ chart          = "k8s-monitoring" -> (known after apply)
          ~ first_deployed = 1753948983 -> (known after apply)
          ~ last_deployed  = 1763375004 -> (known after apply)
          ~ name           = "k8s-monitoring" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                Grafana k8s-monitoring Helm chart deployed!
                
                This chart will install the following components:
                * Grafana Alloy "alloy-logs" (daemonset)
                
                It will:
                * Gather Kubernetes Cluster events from the namespaces authentication,core,correspondence,dialogporten,platform and send data to loki.
                * Gather logs from Kubernetes Pods and send data to loki.
                  
                  
                
                Thanks for trying out the alloy-operator!
            EOT -> (known after apply)
          ~ revision       = 9 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - alloy-logs      = {
                      - alloy      = {
                          - clustering = {
                              - enabled = true
                            }
                          - mounts     = {
                              - dockercontainers = false
                              - varlog           = false
                            }
                        }
                      - controller = {
                          - podAnnotations = {
                              - "kubernetes.azure.com/set-kube-service-host-fqdn" = "true"
                            }
                        }
                      - enabled    = true
                    }
                  - alloy-metrics   = {
                      - enabled = false
                    }
                  - alloy-profiles  = {
                      - enabled = false
                    }
                  - alloy-receiver  = {
                      - enabled = false
                    }
                  - alloy-singleton = {
                      - enabled = false
                    }
                  - cluster         = {
                      - name = "k6tests-cluster"
                    }
                  - clusterEvents   = {
                      - collector  = "alloy-logs"
                      - enabled    = true
                      - namespaces = [
                          - "authentication",
                          - "core",
                          - "correspondence",
                          - "dialogporten",
                          - "platform",
                        ]
                    }
                  - destinations    = [
                      - {
                          - auth   = {
                              - passwordKey = "password"
                              - type        = "basic"
                              - usernameKey = "username"
                            }
                          - name   = "loki"
                          - secret = {
                              - create    = false
                              - name      = "canary-basic-auth"
                              - namespace = "monitoring"
                            }
                          - type   = "loki"
                          - url    = "http://loki-loki-distributed-gateway.monitoring.svc.cluster.local/loki/api/v1/push"
                        },
                    ]
                  - nodeLogs        = {
                      - enabled = false
                    }
                  - podLogs         = {
                      - collector    = "alloy-logs"
                      - enabled      = true
                      - gatherMethod = "kubernetesApi"
                      - labels       = {
                          - app_kubernetes_io_name = "app.kubernetes.io/name"
                          - test_name              = "test_name"
                          - testid                 = "testid"
                        }
                      - labelsToKeep = [
                          - "app.kubernetes.io/name",
                          - "container",
                          - "instance",
                          - "job",
                          - "level",
                          - "namespace",
                          - "service.name",
                          - "service.namespace",
                          - "deployment.environment",
                          - "deployment.environment.name",
                          - "k8s.namespace.name",
                          - "k8s.deployment.name",
                          - "k8s.statefulset.name",
                          - "k8s.daemonset.name",
                          - "k8s.cronjob.name",
                          - "k8s.job.name",
                          - "k8s.node.name",
                          - "testid",
                          - "test_name",
                        ]
                      - namespaces   = [
                          - "authentication",
                          - "core",
                          - "correspondence",
                          - "dialogporten",
                          - "platform",
                        ]
                    }
                }
            ) -> (known after apply)
          ~ version        = "3.3.2" -> (known after apply)
        } -> (known after apply)
        name                       = "k8s-monitoring"
      ~ version                    = "3.3.2" -> "3.5.3"
        # (29 unchanged attributes hidden)
    }

  # helm_release.ingress_nginx will be updated in-place
  ~ resource "helm_release" "ingress_nginx" {
      ~ id                         = "ingress-nginx" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "1.13.1" -> (known after apply)
          ~ chart          = "ingress-nginx" -> (known after apply)
          ~ first_deployed = 1755083977 -> (known after apply)
          ~ last_deployed  = 1762875204 -> (known after apply)
          ~ name           = "ingress-nginx" -> (known after apply)
          ~ namespace      = "ingress-nginx" -> (known after apply)
          ~ notes          = <<-EOT
                The ingress-nginx controller has been installed.
                It may take a few minutes for the load balancer IP to be available.
                You can watch the status by running 'kubectl get service --namespace ingress-nginx ingress-nginx-controller --output wide --watch'
                
                An example Ingress that makes use of the controller:
                  apiVersion: networking.k8s.io/v1
                  kind: Ingress
                  metadata:
                    name: example
                    namespace: foo
                  spec:
                    ingressClassName: nginx
                    rules:
                      - host: www.example.com
                        http:
                          paths:
                            - pathType: Prefix
                              backend:
                                service:
                                  name: exampleService
                                  port:
                                    number: 80
                              path: /
                    # This section is only required if TLS is to be enabled for the Ingress
                    tls:
                      - hosts:
                        - www.example.com
                        secretName: example-tls
                
                If TLS is enabled for the Ingress, a Secret containing the certificate and key must also be provided:
                
                  apiVersion: v1
                  kind: Secret
                  metadata:
                    name: example-tls
                    namespace: foo
                  data:
                    tls.crt: <base64 encoded cert>
                    tls.key: <base64 encoded key>
                  type: kubernetes.io/tls
            EOT -> (known after apply)
          ~ revision       = 7 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - controller = {
                      - service = {
                          - annotations = {
                              - "service.beta.kubernetes.io/azure-load-balancer-health-probe-request-path" = "/healthz"
                            }
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "4.13.1" -> (known after apply)
        } -> (known after apply)
        name                       = "ingress-nginx"
      ~ version                    = "4.13.1" -> "4.13.3"
        # (29 unchanged attributes hidden)
    }

  # helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
      ~ id                         = "kube-prometheus-stack" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.85.0" -> (known after apply)
          ~ chart          = "kube-prometheus-stack" -> (known after apply)
          ~ first_deployed = 1733406099 -> (known after apply)
          ~ last_deployed  = 1762875227 -> (known after apply)
          ~ name           = "kube-prometheus-stack" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                  echo "Visit http://127.0.0.1:9100 to use your application"
                  kubectl port-forward --namespace monitoring $POD_NAME 9100
                kube-prometheus-stack has been installed. Check its status by running:
                  kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                
                Get Grafana 'admin' user password by running:
                
                  kubectl --namespace monitoring get secrets kube-prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 -d ; echo
                
                Access Grafana local instance:
                
                  export POD_NAME=$(kubectl --namespace monitoring get pod -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=kube-prometheus-stack" -oname)
                  kubectl --namespace monitoring port-forward $POD_NAME 3000
                
                Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
                
                kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                The exposed metrics can be found here:
                https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                
                The metrics are exported on the HTTP endpoint /metrics on the listening port.
                In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                
                They are served either as plaintext or protobuf depending on the Accept header.
                They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
            EOT -> (known after apply)
          ~ revision       = 29 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - alertmanager = {
                      - enabled = true
                    }
                  - crds         = {
                      - enabled = false
                    }
                  - grafana      = {
                      - enabled = false
                    }
                  - prometheus   = {
                      - enabled        = true
                      - prometheusSpec = {
                          - enableRemoteWriteReceiver = true
                          - externalLabels            = {
                              - cluster = "k6tests-cluster"
                            }
                          - nodeSelector              = {
                              - prometheus = "true"
                            }
                          - podMetadata               = {
                              - labels = {
                                  - "azure.workload.identity/use" = "true"
                                }
                            }
                          - priorityClassName         = "system-cluster-critical"
                          - remoteWrite               = [
                              - {
                                  - azureAd = {
                                      - cloud = "AzurePublic"
                                      - sdk   = {
                                          - tenantId = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                                        }
                                    }
                                  - url     = "https://k6tests-amw-0vej.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-81e9cf1b38fb4648b047399c5593ebda/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                                },
                            ]
                          - resources                 = {
                              - requests = {
                                  - memory = "8Gi"
                                }
                            }
                          - retention                 = "8d"
                          - storageSpec               = {
                              - volumeClaimTemplate = {
                                  - spec = {
                                      - resources = {
                                          - requests = {
                                              - storage = "64Gi"
                                            }
                                        }
                                    }
                                }
                            }
                          - tolerations               = [
                              - {
                                  - effect   = "NoSchedule"
                                  - key      = "workload"
                                  - operator = "Equal"
                                  - value    = "prometheus"
                                },
                            ]
                        }
                      - serviceAccount = {
                          - annotations = {
                              - "azure.workload.identity/client-id" = "c4eeeead-8978-41a4-a989-e6e4aa9df603"
                            }
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "77.10.0" -> (known after apply)
        } -> (known after apply)
        name                       = "kube-prometheus-stack"
      ~ version                    = "77.10.0" -> "77.14.0"
        # (29 unchanged attributes hidden)
    }

  # helm_release.sealed_secrets will be updated in-place
  ~ resource "helm_release" "sealed_secrets" {
      ~ id                         = "sealedsecrets" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.31.0" -> (known after apply)
          ~ chart          = "sealed-secrets" -> (known after apply)
          ~ first_deployed = 1733733169 -> (known after apply)
          ~ last_deployed  = 1762875204 -> (known after apply)
          ~ name           = "sealedsecrets" -> (known after apply)
          ~ namespace      = "sealedsecrets-system" -> (known after apply)
          ~ notes          = <<-EOT
                ** Please be patient while the chart is being deployed **
                
                You should now be able to create sealed secrets.
                
                1. Install the client-side tool (kubeseal) as explained in the docs below:
                
                    https://github.com/bitnami-labs/sealed-secrets#installation-from-source
                
                2. Create a sealed secret file running the command below:
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o [json|yaml] | \
                    kubeseal \
                      --controller-name=sealedsecrets-sealed-secrets \
                      --controller-namespace=sealedsecrets-system \
                      --format yaml > mysealedsecret.[json|yaml]
                
                The file mysealedsecret.[json|yaml] is a commitable file.
                
                If you would rather not need access to the cluster to generate the sealed secret you can run:
                
                    kubeseal \
                      --controller-name=sealedsecrets-sealed-secrets \
                      --controller-namespace=sealedsecrets-system \
                      --fetch-cert > mycert.pem
                
                to retrieve the public cert used for encryption and store it locally. You can then run 'kubeseal --cert mycert.pem' instead to use the local cert e.g.
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o [json|yaml] | \
                    kubeseal \
                      --controller-name=sealedsecrets-sealed-secrets \
                      --controller-namespace=sealedsecrets-system \
                      --format [json|yaml] --cert mycert.pem > mysealedsecret.[json|yaml]
                
                3. Apply the sealed secret
                
                    kubectl create -f mysealedsecret.[json|yaml]
                
                Running 'kubectl get secret secret-name -o [json|yaml]' will show the decrypted secret that was generated from the sealed secret.
                
                Both the SealedSecret and generated Secret must have the same name and namespace.
            EOT -> (known after apply)
          ~ revision       = 7 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "2.17.4" -> (known after apply)
        } -> (known after apply)
        name                       = "sealedsecrets"
      ~ version                    = "2.17.4" -> "2.17.7"
        # (28 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @renovate[bot] |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan` |